# Final_HomeTask1
Итоговая домашняя работа 1 четверть
## Задание
Задача: Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

Примеры:
[“Hello”, “2”, “world”, “:-)”] → [“2”, “:-)”]
[“1234”, “1567”, “-2”, “computer science”] → [“-2”]
[“Russia”, “Denmark”, “Kazan”] → []

## Содержимое проекта

1. **program.cs**  - код программы
2. **shema.drawio** - блок схема программы


## В кратце о программе

Текстовый алгоритм:
1. Запросить у пользователя размерность массива и сохранить в переменной size.

   1.1 Пока size не положительное целое число:

   1.2 Вывести сообщение пользователю "Пожалуйста, введите положительное целое число для размерности массива:".
2. Создать массив строк strArray размерности size.

3. Вводим данные в массив.

    3.1 Для каждого элемента i от 0 до size - 1, выполнить следующие шаги:

        3.1.1 Вывести сообщение пользователю "Введите элемент i + 1:".

        3.1.2 Запросить у пользователя строку и сохранить в переменной input.

    3.2 Пока input пустая строка:

        3.2.1 Вывести сообщение пользователю "Пожалуйста, введите строку:".

        3.2.2 Запросить у пользователя строку и сохранить в переменной input.
4. Присвоить input элементу strArray[i].
5. Создать переменную счетчик совпадений типа - целочисленный.
6. Для каждого элемента str в strArray, выполнить следующие шаги:

        Если str.Length меньше или равно 3, то:
        Вывести str.
        Увеличить счетчик совпадений на 1
7. Проверка счетчика совпадений на нулевое значение
        Если счетчик равен нолю,  то вывести сообщение что  совпадений нет.
        
Код метода в программе

```csharp
void FilterAndPrintShortStrings(string[] array)   // Метод принимает на вход массив строк и выводит строки <=3 символов
{
    Console.WriteLine("Строки длиной 3 и меньше:");
    int count_of_founded = 0; // переменная для отслеживания количества слов соответствующим условиям
    foreach (string str in array)
    {
        if (str.Length <= 3)
        {
            Console.WriteLine(str);
            count_of_founded += 1;
        }
    }
    if (count_of_founded == 0) // проверка на случай если нет соответсвий критериям
    {
        Console.WriteLine("Соответствий не найдено");
    }
}
    ```





